package java240805;

class 소속사{
	String 소속사명;
	String 대표자;
	
	public void 소속사정보() {}
	
	
}

//extends : 상속(소속사란 클래스를 상속받다)
//상속을 받게되면, 수속사를 '부모 클래스'라고하고, 가수 '자식 클래스' 
class 가수 extends 소속사{//클래스안에 필드변수(속성), 메소드(행위), 생성자
	String 가수이름;
	int 가수나이;
	
	public 가수(String 가수이름, int 가수나이){//생성자 : 리턴타입이 없고, 클래스와 이름이 동일하다.
		this.가수이름 = 가수이름;
		this.가수나이 = 가수나이;
	}
	//2-3
	public void 정보조회하기() {
		System.out.println("가수이름 : " + this.가수이름+", 나이 : "+ this.가수나이 );
	}
	//부모클래스에(소속사)에 선언한 메소드를 가져다 쓸 수 있다.
	@Override//부모클래스에서 선언도된 메소드를 가져와서 '재정의'하겠다. => 오버라이딩
		public void 소속사정보() {
		System.out.println("소속사명 : "+ this.소속사명);
		System.out.println("대표자 : "+ this.대표자);
	}
}
	
	//오버로딩 : 동일한 메소드이름 작성 단, 파라미터 타입이 달라야 함
    //오버라이딩 : 부모클래스에 선언된 메소드를 자식클래스에서 가져와 재정의

public class 클래스복습2 {

	public static void main(String[] args) {
		
		가수 가수1 = new 가수("아이유", 30);
		가수1.대표자 = "배종환";
		가수1.소속사명 = "이담엔터테인먼트";
		
		가수 가수2 = new 가수("장원영", 19);	
		가수2.대표자 = "홍길동";
		가수2.소속사명 = "스타쉽엔터테인먼트";
		
		가수1.정보조회하기();
		가수1.소속사정보();
		가수2.정보조회하기();
		가수2.소속사정보();
		
		System.out.println("====================");
		//여러분들이 각자 좋아하는 가수,나이,소속사,대표명을 소속사명을 아래 출력하시오
		
		가수 가수3 = new 가수("성시경", 45);
		가수3.대표자 = "성은정";
		가수3.소속사명 = "제이케이재원";
		
		가수 가수4 = new 가수("송민호", 31);
		가수4.대표자 = "양현석";
		가수4.소속사명 = "YG엔터테인먼트";
		
		가수3.정보조회하기();
		가수3.소속사정보();
		가수4.정보조회하기();
		가수4.소속사정보();
	}
}

