package java240809;

class 부모클래스{
	String 문자열변수1;
}


//클래스 복습은 : 자식클래스(sub) 부모클래스 : 부모(super)
public class 클래스복습 extends 부모클래스{//(상속)
/*
 * 클래스는 필드변수, 생성자, 메소드로 이루어져있다.(캡술화라고 한다.)
 */
	int 필드변수1;
	int 필드변수2;
	
	//리턴타입이 String인 메소드 선언
	public String 단어리턴하기() {
		return "사과";
	}
	
	public int 단어리턴하기(int 숫자) { //오버로딩으로 메소드 이름 중복가능하게 만들기
		
		return 0;
	}
	
	클래스복습(){//생성자(메소드 종류 중 하나)
		/*
		 * 1. 리턴타입이 없다.
		 * 2. 클래스 이름과 동일해야 한다.
		 * 3. 모든 클래스는 기본 생성자가 존재함.
		 * 4. 파라미터 타입이 없는 생성자를 '기본 생성자'라 한다.
		 */
	}
	public 클래스복습(int 파라미터타입) { //오버로딩 : 메소드 이름은 동일 파라미터값만 다름
	
	}
	
	public static void main(String[] args) {
		//객체 클래스 호출.
		
		클래스복습 a = new 클래스복습();
		//new : 객체 호출(인스턴스화 하다)
		//클래스복습() : 생성자 호출
		String word = a.단어리턴하기(); //메소드 호출, .(접근하다)
		System.out.println(word);
		
		a.문자열변수1 = "부모클래스에 있는 변수";//부모 클래스에 있는 필드변수, 생성자, 메소드 모두 사용가능.
		
	}

}
